# GetVPClOvrdFillOpty

## Description
Retrieves the fill opacity for a viewport class override.

```pascal
FUNCTION GetVPClOvrdFillOpty(
				viewportHandle : HANDLE;
				className      : STRING): INTEGER;
```

```python
def vs.GetVPClOvrdFillOpty(viewportHandle, className):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|
|className|STRING|Name of the class.|

## See Also
VS Functions:
SetVPClOvrdFillOpty

## Version
Availability: from Vectorworks 2014

## Category
* Viewports